app/controllers/api/v1/sessions_controller.rb

  def create
    user = User.authenticate(params[:session][:email],
                             params[:session][:password])
    if user.present?
      api_key = ApiKey.create(user_id: user.id, client_id: @client_id)
---
SELECT "users".* FROM "users" WHERE "users"."email" = 'spatlemail@gmail.com' LIMIT 1
INSERT INTO "api_keys" ("access_token", "active", "client_id", "created_at", "expires_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?)