app/controllers/api/v1/users_controller.rb

  def create
    @user = User.new(params[:user])

    if @user.save
        user_detail = @user.build_user_detail(params[:user_detail])
        user_detail.save
---
INSERT INTO "users" ("created_at", "email", "encrypted_password", "salt", "updated_at") VALUES (?, ?, ?, ?, ?)
INSERT INTO "user_details" ("created_at", "first_name", "last_name", "mobile_number", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?)